src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ПроизводственныйКалендарь</schedule>
  <scheduleValue>InformationRegister.ПроизводственныйКалендарь.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ПроизводственныйКалендарь.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.Начисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Параметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <recalculations>
    <name>Перерасчет1</name>
  </recalculations>
</mdclass:CalculationRegister>

src/ChartsOfCalculationTypes/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>Начисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.Начисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ОкладПоДням</name>
      <description>Оклад по дням</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>Прогул</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

src/CommonModules/Расчеты/Module.bsl
Процедура РассчитатьЗаписи(Ссылка) Экспорт
	
	НаборЗаписей = РегистрыРасчета.Начисления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		ВидРасчета = Запись.ВидРасчета;
		
		Если ВидРасчета = ПланыВидовРасчета.Начисления.Оклад Тогда 
			
			Норма = Запись.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия)[0].Признак;
			Факт = Запись.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия)[0].Признак;
			Запись.Сумма = Факт / Норма * Запись.Параметр;
			
		ИначеЕсли ВидРасчета = ПланыВидовРасчета.Начисления.Премия Тогда
			
			Ресурсы = Новый Массив;
			Ресурсы.Добавить("Начисления.Сумма");
			
			Измерения = Новый Структура;
			Измерения.Вставить("Сотрудник", "Начисления.Сотрудник");
			
			ТЗБаза = Запись.ПолучитьБазу(Ресурсы, Измерения);
			
			Запись.Сумма = ТЗБаза[0].Сумма * Запись.Параметр / 100;
			
			
		ИначеЕсли ВидРасчета = ПланыВидовРасчета.Начисления.ОкладПоДням Тогда
			
			Факт = Запись.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия)[0].Признак;
			Запись.Сумма = Факт * Запись.Параметр; 
			
		КонецЕсли;
		
	КонецЦикла;    
	
	НаборЗаписей.Записать(,, Ложь);
	
КонецПроцедуры
